'''
正则表达式校验表单
'''

from enum import Enum


class FormRegex(Enum):
    # 用户名(支持英文/数字/下划线,且不能为纯数字)
    # USERNAME = '^(?!\d+$)[a-zA-Z0-9_]'
    USERNAME = '^[a-zA-Z0-9_]'
    # 手机号
    MOBILE = '^(1[3-9])\d{9}$'
    # 客服电话/手机号
    SERVICE_PHONE = '^\d{3}-\d{8}|(1[3-9])\d{9}$'
    # 密码(支持数字/大小写字母/不能有空格)
    PASSWORD = '^\S+[a-zA-Z0-9_]'
    # 用户姓名(支持汉字/英文/数字)
    REALNAME = '^[\u4e00-\u9fa5_a-zA-Z0-9]'
    # 经度
    LON = '^[\-\+]?(0(\.\d{1,10})?|([1-9](\d)?)(\.\d{1,10})?|1[0-7]\d{1}(\.\d{1,10})?|180\.0{1,10})$'
    # 纬度
    LAT = '^[\-\+]?((0|([1-8]\d?))(\.\d{1,10})?|90(\.0{1,10})?)$'
    # 时间区间
    SECTION = '\d+(\.\d+)?(,(\d+(\.\d+)?)?)?'
    # 汉字
    HAN_ZI = '[\u4E00-\u9FA5]+'
    # 支持汉字、英文和数字,且不能为纯数字
    TEXT_PROJECT = '([\u4e00-\u9fa5a-zA-Z]+[0-9]*)'
    # 支持数字、字母、逗号、分号、小数点、横线、冒号：
    TEXT_CAMERA = '^[-a-zA-Z0-9,;.:]+$'
    # 支持小写字母、数字
    TEXT_KEY = '^[a-z0-9]+$'
    # 支持数字
    TEXT_SPOT = '^[0-9]+$'
    # 支持字母、横线
    TEXT_ORDER_BY = '^[-a-zA-Z_]+$'
    # 网址校验
    TEXT_URL = '^(https|http?://)'
    # TEXT_URL = '^((ht|f)tps?):\/\/[\w\-]+(\.[\w\-]+)+([\w\-.,@?^=%&:\/~+#]*[\w\-@?^=%&\/~+#])?$'
    # 校验client_id
    CLIENT_ID = '^[a-zA-Z0-9]+$'
